src/test/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:greetRequest>
         <gs:name>1</gs:name>
      </gs:greetRequest>
   </soapenv:Body>
</soapenv:Envelope>
